app/views/blogs/_blog.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["blog_id", 37], ["blog_id", 36], ["blog_id", 34], ["blog_id", 33], ["blog_id", 32], ["blog_id", 31], ["blog_id", 30], ["blog_id", 27], ["blog_id", 26]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 13]]
---
                <path d="M21 11.5a8.38 8.38 0 01-.9 3.8 8.5 8.5 0 01-7.6 4.7 8.38 8.38 0 01-3.8-.9L3 21l1.9-5.7a8.38 8.38 0 01-.9-3.8 8.5 8.5 0 014.7-7.6 8.38 8.38 0 013.8-.9h.5a8.48 8.48 0 018 8v.5z"></path>
              </svg><%=@blog.comments.size%>

SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 19]]
---
                    <path d="M21 11.5a8.38 8.38 0 01-.9 3.8 8.5 8.5 0 01-7.6 4.7 8.38 8.38 0 01-3.8-.9L3 21l1.9-5.7a8.38 8.38 0 01-.9-3.8 8.5 8.5 0 014.7-7.6 8.38 8.38 0 013.8-.9h.5a8.48 8.48 0 018 8v.5z"></path>
                  </svg><%=@blog.comments.size%>