app/views/blogs/post.html.erb

                                <% unless current_user.nil?%>
                                <div class="float-right" x-data="{ count: <%=comment.likes.size%>, liked: <%=!comment.likes.select{|item| item.user_id == current_user.id}.empty?%> }">
---
SELECT "likes".* FROM "likes" WHERE "likes"."comment_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["comment_id", 1], ["comment_id", 2], ["comment_id", 3], ["comment_id", 4], ["comment_id", 5], ["comment_id", 7], ["comment_id", 8], ["comment_id", 9], ["comment_id", 10], ["comment_id", 11]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."comment_id" = $1  [["comment_id", 11]]