app/views/blogs/post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 19]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 22]]
---

            <h4 class="py-5">Comments(<%=@blog.comments.count%>)</h4>

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1 ORDER BY created_at desc  [["blog_id", 19]]
SELECT 1 AS one FROM "comments" WHERE "comments"."blog_id" = $1 LIMIT $2  [["blog_id", 19], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 19]]
---
<!-- component -->
<% unless @blog.comments.empty? %>
<% @blog.comments.each do |comment| %>