app/controllers/blogs_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."comment_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["comment_id", 1], ["comment_id", 2], ["comment_id", 3], ["comment_id", 4], ["comment_id", 5], ["comment_id", 7], ["comment_id", 8], ["comment_id", 9], ["comment_id", 10], ["comment_id", 11]]
---
  def show
    begin
      @blog = Blog.where(active: true).order('comments.created_at desc').includes(:comments => [:likes, :user]).find_by_hashid(params[:id])