app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.where(active: true).order('created_at desc').includes(:comments, :user).page(params['page']).per(PER_PAGE)
---
SELECT "blogs".* FROM "blogs" INNER JOIN "comments" ON "comments"."blog_id" = "blogs"."id" WHERE "blogs"."active" = $1 ORDER BY created_at desc LIMIT $2 OFFSET $3  [["active", true], ["LIMIT", 9], ["OFFSET", 0]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["blog_id", 37], ["blog_id", 36], ["blog_id", 34], ["blog_id", 33], ["blog_id", 32], ["blog_id", 31], ["blog_id", 30], ["blog_id", 27], ["blog_id", 26]]
SELECT COUNT(*) FROM "blogs" INNER JOIN "comments" ON "comments"."blog_id" = "blogs"."id" WHERE "blogs"."active" = $1  [["active", true]]

  def user_blogs
    # @blogs = Blog.where(active: true).order('comments.created_at desc').page(params['page']).per(PER_PAGE).includes(comments: :user).find_by(user_id: params[:user_id])
    begin
      @user = User.find_by(username: params["username"])
      @blogs = Blog.where(user_id: @user.id, active: true).order('created_at desc').includes(:comments, :user).page(params['page']).per(PER_PAGE)
      @color = @blogs.first.user.settings(:settings).user_blog_color
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "b9YtZb"], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["blog_id", 37], ["blog_id", 36], ["blog_id", 34], ["blog_id", 33], ["blog_id", 32], ["blog_id", 31], ["blog_id", 30], ["blog_id", 27], ["blog_id", 26]]
SELECT DISTINCT comments.created_at AS alias_0, "blogs"."id" FROM "blogs" LEFT OUTER JOIN "comments" ON "comments"."blog_id" = "blogs"."id" LEFT OUTER JOIN "users" ON "users"."id" = "comments"."user_id" WHERE "blogs"."active" = $1 AND "blogs"."user_id" = $2 ORDER BY comments.created_at desc LIMIT $3 OFFSET $4  [["active", true], ["user_id", nil], ["LIMIT", 1], ["OFFSET", 0]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."active" = $1 AND "blogs"."id" IS NULL ORDER BY created_at desc LIMIT $2 OFFSET $3  [["active", true], ["LIMIT", 1], ["OFFSET", 0]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def show
    # begin
      @blog = Blog.where(active: true).order('comments.created_at desc').includes(:comments => [:likes, :user]).find_by_hashid(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."comment_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["comment_id", 1], ["comment_id", 2], ["comment_id", 3], ["comment_id", 4], ["comment_id", 5], ["comment_id", 7], ["comment_id", 8], ["comment_id", 9], ["comment_id", 10], ["comment_id", 11]]
INSERT INTO "blogs" ("blog_title", "blog_text", "created_at", "updated_at", "user_id", "active", "blog_description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def save_edit_blog
    @blog = current_user.blogs.find_by_hashid(params[:id])
    blog_categories = []
    @blog.blog_title = params[:blog_title]
    @blog.blog_description = params[:blog_description]
    @blog.blog_text = params[:blog_text]
    @blog.active = params[:active]

    categories = params[:categories].reject { |e| e.to_s.empty? }
    blog_categories = []

    ActiveRecord::Base.transaction do
      @blog.blog_categories.destroy_all
      categories.each do |cat_item|
        blog_categories << BlogCategory.new(blog_id: @blog.id, category_id: cat_item )
---
INSERT INTO "blogs" ("blog_title", "blog_text", "created_at", "updated_at", "user_id", "active", "blog_description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"