app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.order('created_at desc').where(active: true).page(params['page']).per(PER_PAGE)
---
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."active" = $1  [["active", true]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."active" = $1 AND "blogs"."id" IS NULL ORDER BY created_at desc LIMIT $2 OFFSET $3  [["active", true], ["LIMIT", 1], ["OFFSET", 0]]

  def user_blogs
    # @blogs = Blog.where(active: true).order('comments.created_at desc').page(params['page']).per(PER_PAGE).includes(comments: :user).find_by(user_id: params[:user_id])
    begin
      @user = User.find_by_hashid(params["user_id"])
      @blogs = Blog.where(user_id: @user.id, active: true).order('created_at desc').page(params['page']).per(PER_PAGE)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1 AND "blogs"."active" = $2 ORDER BY created_at desc LIMIT $3 OFFSET $4  [["user_id", 4], ["active", true], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."user_id" = $1 AND "blogs"."active" = $2  [["user_id", 4], ["active", true]]

  def save_new_blog
    @blog = current_user.blogs.build(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("blog_title", "blog_text", "comments_count", "created_at", "updated_at", "user_id", "active", "blog_description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def show
    begin
      @blog = Blog.where(active: true).order('comments.created_at desc').includes(comments: :user).find(params[:id])
---
SELECT DISTINCT comments.created_at AS alias_0, "blogs"."id" FROM "blogs" LEFT OUTER JOIN "comments" ON "comments"."blog_id" = "blogs"."id" LEFT OUTER JOIN "users" ON "users"."id" = "comments"."user_id" LEFT OUTER JOIN "likes" ON "likes"."comment_id" = "comments"."id" WHERE "blogs"."active" = $1 AND "blogs"."id" = $2 ORDER BY comments.created_at desc LIMIT $3  [["active", true], ["id", 19], ["LIMIT", 1]]

  def save_edit_blog
    @blog = current_user.blogs.find_by_hashid(params[:id])
    @blog.blog_title = params[:blog_title]
    @blog.blog_description = params[:blog_description]
    @blog.blog_text = params[:blog_text]
    @blog.active = params[:active]

    respond_to do |format|
      if @blog.save
---
UPDATE "blogs" SET "updated_at" = $1, "blog_description" = $2 WHERE "blogs"."id" = $3  [["updated_at", "2022-05-31 11:21:59.969904"], ["blog_description", "fggggggggggggggggggggggggggggg"], ["id", 37]]

  def user_blogs_list
    @blogs = current_user.blogs.order('created_at desc').page(params['page']).per(PER_PAGE)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1 ORDER BY created_at desc LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."user_id" = $1  [["user_id", 4]]

  def toggle_blog_status
    begin
      @blog = current_user.blogs.find_by_hashid(params[:id])
      @blog.active = !@blog.active
      @blog.save
---
UPDATE "blogs" SET "updated_at" = $1, "active" = $2 WHERE "blogs"."id" = $3  [["updated_at", "2022-05-31 10:21:20.918011"], ["active", false], ["id", 28]]

  def delete_user_blog
    begin
      @blog = current_user.blogs.find_by_hashid(params[:id])
      @blog.destroy
---
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 36]]