app/controllers/comments_controller.rb

  def save
    # @comment = current_user.comments.build(comment_params)
    @post = Post.find_by_hashid(params[:id])
    @comment = Comment.new(body: params['body'], user_id: current_user.id, post_id: @post.id)
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "blog_id", "likes_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "gggggggggggg"], ["user_id", 1], ["blog_id", 1], ["likes_count", nil], ["created_at", "2022-06-02 06:04:27.361034"], ["updated_at", "2022-06-02 06:04:27.361034"]]