app/controllers/likes_controller.rb

  def save
    @like = Like.find_or_initialize_by(like_params)
    @like.persisted? ? res = @like.destroy : res = @like.save
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 29]]