app/models/blog.rb

  def next
    nxt ||= Blog.where("id > ?", id).where(active: true).first
---
SELECT "blogs".* FROM "blogs" WHERE (id < 19) AND "blogs"."active" = $1 ORDER BY "blogs"."id" DESC LIMIT $2  [["active", true], ["LIMIT", 1]]